Revit 2027 API
BuiltInFailures.EditingFailures.CannotMoveLockedWarning Property
 Can't move pinned element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotMoveLockedWarning { get; }
Public Shared ReadOnly Property CannotMoveLockedWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotMoveLockedWarning {
	FailureDefinitionId^ get ();
}
static member CannotMoveLockedWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace